<?php

//1. Використовуючи один або декілька циклів (for, if/else, while, switch/case), визначити день тижня коли ви народилися вводячи лише дату народження.
//Приклад:
//Вхідні дані - 27 July 1989
//Вихідні дані - Thursday
$timestamp = strtotime('1989-01-12');

$day = date('l', $timestamp);
echo "You were born on $day";
echo "<br />";


//2. Обчислити приклад відповідно до всіх правил та порядковості виконнання математичних операцій. Результатом повинно бути число x із 5 знаками після коми
//a=24.65
//b=10.97

$a=24.65;
$b=10.97;
$x=sqrt((255+$a)**4/(13*M_PI+12/$b)**3);
echo round($x, 5);
echo "<br />";


//3. Знаючи значення n! ( n! = 1*2*3*...*(n-1)*n ) встановити і вивести значення n
//Приклад:
//Вхідні дані - 40320
//Вихідні дані - 8

$a = 40320;
$b = 2;
while($a>1){
    $a/=$b;
    $b++;
}
if ($a == 1){
    echo ($b-1);
}
else{
    echo "Wrong number";
}


//7a. Написати функцію яка зафарбовує букви які стоять в парному порядку в один колір, в не парному - в інший.
//Вхідні данні:
//(string) Ukraine






