<?php

//1. Використовуючи один або декілька циклів (for, if/else, while, switch/case), визначити день тижня коли ви народилися вводячи лише дату народження.
//Приклад:
//Вхідні дані - 27 July 1989
//Вихідні дані - Thursday




//2. Обчислити приклад відповідно до всіх правил та порядковості виконнання математичних операцій. Результатом повинно бути число x із 5 знаками після коми
//a=24.65
//b=10.97

$a=24.65;
$b=10.97;
$x=sqrt((255+$a)**4/(13*M_PI+12/$b)**3);
echo round($x, 5);


//3. Знаючи значення n! ( n! = 1*2*3*...*(n-1)*n ) встановити і вивести значення n
//Приклад:
//Вхідні дані - 40320
//Вихідні дані - 8